Revit 2026 API

# ScheduleSortGroupFieldShowFooterTitle Property

---

Indicates if the footer row should display a title.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ShowFooterTitle { get; set; }
```
```vb
Public Property ShowFooterTitle As Boolean
	Get
	Set
```
```cpp
public:
property bool ShowFooterTitle {
	bool get ();
	void set (bool value);
}
```
```fsharp
member ShowFooterTitle : bool with get, set
```

#### Property Value

Boolean True if a title should be displayed, false otherwise.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: Display of footer rows is not enabled. |

The title consists of the value of the field that the schedule is grouped by.

ShowFooterTitle can only be enabled if ShowFooter is enabled.

#### Reference

ScheduleSortGroupField Class

Autodesk.Revit.DB Namespace